// ************************************ 01 ************************************

//1. Використовуючи конструкцію if... else,
//напишіть код, який буде запитувати:
//"Яке офіційне ім'я JavaScript?"
//Якщо користувач вводить "ECMAScript",
//то показати через сповіщення: "Вірно!"
//у протилежному випадку показати:"Не знаєте? ECMAScript!"

// -----------------------------------------------------------------------------

// const name = prompt("Яке офіційне ім'я JavaScript ? ");
// name === 'ECMAScript' ? alert('Вірно!') : alert('Не знаєте? ECMAScript!');

// ************************************ 02 ************************************

//За допомогою циклу for напишіть код,
// який буде виводити в консоль всі парні числа від min до max

// -----------------------------------------------------------------------------

// const makeEven = (min, max) => {
//   const even = [];
//   for (let number = min; number <= max; number += 1) {
//     if (number % 2 === 0) {
//       even.push(number);
//     }
//   }
//   console.table(even);
// };
// makeEven(2, 11);

// ************************************ 03 ************************************

// У змінній min лежить число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число(у першу, другу, третю чи четверту).

// -----------------------------------------------------------------------------

// const getQuarter = () => {
//   let num = 0;
//   do {
//     num = prompt('Enter number from 0 to 59');
//   } while (num < 0 || num > 59);

//   switch (Math.floor(num / 15)) {
//     case 0:
//       console.log('1-st quarter');
//       break;
//     case 1:
//       console.log('2-nd quarter');
//       break;
//     case 2:
//       console.log('3-d quarter');
//       break;
//     default:
//       console.log('4-th quarter');
//   }
// };
// getQuarter();

// ************************************ 04 ************************************

//Дано рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// -----------------------------------------------------------------------------

// const checkLetter = (letter, string) => {
//   string.at(0) === letter ? console.log('Yes') : console.log('No');
// };
// checkLetter('a', 'adfsdfaas');

// ************************************ 05 ************************************

//При завантаженні сторінки користувачеві пропонується в prompt ввести число.
// Введення додається до значення змінної total.
//Операція введення числа триває до того часу,
//Поки користувач не натисне кнопку Cancel в prompt.
//Після того, як користувач припинив введення натиснувши на
//кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."

// -----------------------------------------------------------------------------

// const getSum = () => {
//   let total = 0;
//   let number = 0;
//   do {
//     number = prompt('Enter any number');
//     if (Number(number) == number) {
//       total += Number(number);
//     }
//   } while (number !== null);
//   alert(`Total sum entered numbers is ${total}`);
// };
// getSum();
