//1. Використовуючи конструкцію if... else,
//напишіть код, який буде запитувати:
//"Яке офіційне ім'я JavaScript?"
//Якщо користувач вводить "ECMAScript",
//то показати через сповіщення: "Вірно!"
//у протилежному випадку показати:"Не знаєте? ECMAScript!"

//  1
// const response = prompt("Яке офіційне ім'я JavaScript?");
// if (response === "ECMAScript") {
//   alert("Вірно!");
// } else alert("Не знаєте? ECMAScript!");

//  2
// const response = prompt("Яке офіційне ім'я JavaScript?");

// response === "ECMAScript" ? alert("Вірно!") : alert("Не знаєте? ECMAScript!");

//  3
// const response = prompt("Яке офіційне ім'я JavaScript?");

// alert(response === "ECMAScript" ? "Вірно!" : "Не знаєте? ECMAScript!");

// -----------------------------------------------------------------------------

//За допомогою циклу for напишіть код,
// який буде виводити в консоль всі парні числа від min до max
// const max = 50;
// const min = 0;
// for (let i = min; i <= max; i += 1) {
//   if (i % 2 === 0 && i !== 0) {
//     console.log(i);
//   }
// }

// -----------------------------------------------------------------------------

// У змінній min лежить число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число(у першу, другу, третю чи четверту).

// const min = 42;
// if (min > 0 && min <= 15) {
//   console.log('Перша чверть');
// } else if (min > 15 && min <= 30) {
//   console.log('Друга чверть');
// } else if (min > 30 && min <= 45) {
//   console.log('Третя чверть');
// } else console.log('Четверта чверть');

// -----------------------------------------------------------------------------

//Дано рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// -----------------------------------------------------------------------------

//При завантаженні сторінки користувачеві пропонується вprompt ввести число.
// Введення додається до значення змінної total.
//Операція введення числа триває до того часу,
//Поки користувач не натисне кнопку Cancel в prompt.
//Після того, як користувач припинив введення натиснувши на
//кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
